tiiuae/nuttx/arch/arm/src/stm32n6/hardware/stm32n6xxx_tim.h
#define GTIM_TISEL_TIXSEL_MASK(ch)  (0xf << (((ch) - 1) * 8))   /* Mask  for TIM_CHx, x=1..4*/
#define GTIM_TISEL_TIXSEL(ch, in)   ((in) << (((ch) - 1) * 8))  /* Ch=1..4, in=0..15 */

/* Alternate Function Register 1 */

#define GTIM_AF1_BKINE            (1 << 0)  /* TIMx_BKIN input enable */
#define GTIM_AF1_BKCMP1E          (1 << 1)  /* tim_brk_cmp1 enable */
#define GTIM_AF1_BKCMP2E          (1 << 2)  /* tim_brk_cmp2 enable */
#define GTIM_AF1_BKCMP3E          (1 << 3)  /* tim_brk_cmp3 enable */
#define GTIM_AF1_BKCMP4E          (1 << 4)  /* tim_brk_cmp4 enable */
#define GTIM_AF1_BKCMP5E          (1 << 5)  /* tim_brk_cmp5 enable */
#define GTIM_AF1_BKCMP6E          (1 << 6)  /* tim_brk_cmp6 enable */
#define GTIM_AF1_BKCMP7E          (1 << 7)  /* tim_brk_cmp7 enable */
#define GTIM_AF1_BKCMP8E          (1 << 8)  /* tim_brk_cmp8 enable */
#define GTIM_AF1_BKINP            (1 << 9)  /* TIMx_BKIN input polarity */
#define GTIM_AF1_BKCMP1P          (1 << 10) /* tim_brk_cmp1 input polarity */
#define GTIM_AF1_BKCMP2P          (1 << 11) /* tim_brk_cmp2 input polarity */
#define GTIM_AF1_BKCMP3P          (1 << 12) /* tim_brk_cmp3 input polarity */
#define GTIM_AF1_BKCMP4P          (1 << 13) /* tim_brk_cmp4 input polarity */
#define GTIM_AF1_ETRSEL_SHIFT     (14)      /* Bits 14-17: etr_in source selection */
#define GTIM_AF1_ETRSEL_MASK      (0xf << GTIM_AF1_ETRSEL_SHIFT)
#  define GTIM_AF1_ETRSEL(src)    ((src) << GTIM_AF1_ETRSEL_SHIFT) /* etr_in source selection src=0..15*/

/* Alternate Function Register 2 */

#define GTIM_AF2_OCRSEL_SHIFT     (16)      /* ocref_clr source selection */
#define GTIM_AF2_OCRSEL_MASK      (7 << GTIM_AF2_OCRSEL_SHIFT)
#  define GTIM_AF2_OCRSEL(n)      ((n) << GTIM_AF2_OCRSEL_SHIFT) /* n=0..7 */

/* DMA Control Register */

#define GTIM_DCR_DBA_SHIFT        (0)       /* Bits 4-0: DMA Base Address */
#define GTIM_DCR_DBA_MASK         (0x1f << GTIM_DCR_DBA_SHIFT)
#define GTIM_DCR_DBL_SHIFT        (8)       /* Bits 12-8: DMA Burst Length */
#define GTIM_DCR_DBL_MASK         (0x1f << GTIM_DCR_DBL_SHIFT)
#define GTIM_DCR_DBSS_SHIFT       (16)      /* Bits 16-19: DMA burst source selection */
#define GTIM_DCR_DBSS_MASK        (0xf << GTIM_DCR_DBSS_SHIFT)
#  define GTIM_DCR_DBSS_UPDATE    (1 << GTIM_DCR_DBSS_SHIFT)
#  define GTIM_DCR_DBSS_CC1       (2 << GTIM_DCR_DBSS_SHIFT)

/* Repetition Counter Register - TIM15, TIM16, TIM17 */

#define GTIM_RCR_REP_SHIFT      (0)
#define GTIM_RCR_REP_MASK       (0xff << GTIM_RCR_REP_SHIFT) /* Repetition counter reload value */

/* Break and Dead-time Register - TIM15, TIM16, TIM17 */

#define GTIM_BDTR_DTG_SHIFT     (0)   /* Dead-time generator setup */
#define GTIM_BDTR_DTG_MASK      (0xff << GTIM_BDTR_DTG_SHIFT)
#define GTIM_BDTR_LOCK_SHIFT    (8)   /* Bits 8-9: Lock configuration */
#define GTIM_BDTR_LOCK_MASK     (3 << GTIM_BDTR_LOCK_SHIFT)
#  define GTIM_BDTR_LOCK_OFF    (0 << GTIM_BDTR_LOCK_SHIFT)
#  define GTIM_BDTR_LOCK_LV1    (1 << GTIM_BDTR_LOCK_SHIFT)
#  define GTIM_BDTR_LOCK_LV2    (2 << GTIM_BDTR_LOCK_SHIFT)
#  define GTIM_BDTR_LOCK_LV3    (3 << GTIM_BDTR_LOCK_SHIFT)

#define GTIM_BDTR_OSSR          (1 << 11)
#define GTIM_BDTR_BKE           (1 << 12)
#define GTIM_BDTR_BKP           (1 << 13) /* Break polarity */
#define GTIM_BDTR_AOE           (1 << 14) /* Automatic output enable */
#define GTIM_BDTR_MOE           (1 << 15) /* Main output enable */
#define GTIM_BDTR_BKF_SHIFT     (16)      /* Bits 16-19: Break filter */
#define GTIM_BDTR_BKF_MASK      (0xf << GTIM_BDTR_BKF_SHIFT)
#define GTIM_BDTR_BKF(f)        ((f) << GTIM_BDTR_BKF_SHIFT) /* See GTIM_BDTR_BKF_xxxxx below*/

#define GTIM_BDTR_BKF_NOFILT    (0)       /* 0000: No filter, sampling at fDTS */
#define GTIM_BDTR_BKF_FCKINT2   (1)       /* 0001: fSAMPLING=fCK_INT, N=2 */
#define GTIM_BDTR_BKF_FCKINT4   (2)       /* 0010: fSAMPLING=fCK_INT, N=4 */
#define GTIM_BDTR_BKF_FCKINT8   (3)       /* 0011: fSAMPLING=fCK_INT, N=8 */
#define GTIM_BDTR_BKF_FDTSd26   (4)       /* 0100: fSAMPLING=fDTS/2, N=6 */
#define GTIM_BDTR_BKF_FDTSd28   (5)       /* 0101: fSAMPLING=fDTS/2, N=8 */
#define GTIM_BDTR_BKF_FDTSd46   (6)       /* 0110: fSAMPLING=fDTS/4, N=6 */
#define GTIM_BDTR_BKF_FDTSd48   (7)       /* 0111: fSAMPLING=fDTS/4, N=8 */
#define GTIM_BDTR_BKF_FDTSd86   (8)       /* 1000: fSAMPLING=fDTS/8, N=6 */
#define GTIM_BDTR_BKF_FDTSd88   (9)       /* 1001: fSAMPLING=fDTS/8, N=8 */
#define GTIM_BDTR_BKF_FDTSd165  (10)      /* 1010: fSAMPLING=fDTS/16, N=5 */
#define GTIM_BDTR_BKF_FDTSd166  (11)      /* 1011: fSAMPLING=fDTS/16, N=6 */
#define GTIM_BDTR_BKF_FDTSd168  (12)      /* 1100: fSAMPLING=fDTS/16, N=8 */
#define GTIM_BDTR_BKF_FDTSd325  (13)      /* 1101: fSAMPLING=fDTS/32, N=5 */
#define GTIM_BDTR_BKF_FDTSd326  (14)      /* 1110: fSAMPLING=fDTS/32, N=6 */
#define GTIM_BDTR_BKF_FDTSd328  (15)      /* 1111: fSAMPLING=fDTS/32, N=8 */

#define GTIM_BDTR_BKDSRM        (1 << 26) /* Break Disarm */
#define GTIM_BDTR_BKBID         (1 << 28) /* Break bidirectional */

/* Timer Deadtime Register 2 - TIM15, TIM16, TIM17 */

#define GTIM_DTR2_DTGF_SHIFT    (0)
#define GTIM_DTR2_DTGF_MASK     (0xff << GTIM_DTR2_DTGF_SHIFT)
#define GTIM_DTR2_DTAE          (1 << 16) /* Deadtime asymmetric enable */
#define GTIM_DTR2_DTPE          (1 << 17) /* Deadtime preload enable */

#endif /* CONFIG_STM32_STM32N6XXXX */
#endif /* __ARCH_ARM_SRC_STM32N6_HARDWARE_STM32N6XXX_TIM_H */
